{
  "curPatternObj": {
    "patternSteps": {
      "0": " Number of Moves: 61\n",
      "1": " Ready Posture: Parallel Ready Stance\n",
      "2": " Step 1. Turn the face to B while forming a right bending ready A toward B. Perform in a slow motion.\n",
      "3": " Step 2. Execute a high side piercing kick to B with the left foot. Perform in a slow motion.\n",
      "4": " Step 3. Execute a high side piercing kick to B with the left foot. Perform 2 and 3 in a double kick.\n",
      "5": " Step 4. Lower the left foot to B to form a sitting stance toward D while executing a middle thrust to D with the right flat fingertip.\n",
      "6": " Step 5. Execute a high reverse hooking kick to B with the right foot. Perform in a slow motion.\n",
      "7": " Step 6. Lower the right foot to B in a jumping motion to form a right X-stance toward C while executing a middle side strike to B with the right knife-hand.\n",
      "8": " Step 7. Move the left foot to A forming a left walking stance toward A while executing a pressing block to A with the right palm.\n",
      "9": " Step 8. Move the right foot to A to form a right walking stance toward A at the same time executing a pressing block with the left palm.\n",
      "10": " Step 9. Execute a high side block to B with the left knife-hand and a low side block to A with the right knife-hand while forming a right one-leg stance toward D, pulling the left reverse footsword to the right knee joint. Perform in slow motion.\n",
      "11": " Step 10. Lower the left foot to the right foot and then turn the face to A while forming a left bending ready stance A toward A. Perform in slow motion.\n",
      "12": " Step 11. Execute a high side piercing kick to A with the right foot. Perform in a slow motion.\n",
      "13": " Step 12. Execute a high side piercing kick to A with the right foot. Perform 11 and 12 in a double kick.\n",
      "14": " Step 13. Lower the right foot to a to form a sitting stance toward D while executing a middle thrust to D with the left flat fingertip.\n",
      "15": " Step 14. Execute a high reverse hooking kick to A with the left foot. Perform in a slow motion.\n",
      "16": " Step 15. Lower the left foot to A in a jumping motion to form a left X-stance toward C while executing a middle side strike to A with the left knife-hand.\n",
      "17": " Step 16. Move the right foot to B forming a right walking stance toward B while executing a pressing block to B with the left palm.\n",
      "18": " Step 17. Move the left foot to B to form a left walking stance toward B at the same time executing a pressing block with the right palm.\n",
      "19": " Step 18. Execute a high side block to A with the right knife-hand and a low side block to B with the left knife-hand while forming a left one-leg stance toward D, pulling the right reverse footsword to the left knee joint. Perform in slow motion.\n",
      "20": " Step 19. Turn the face to C while forming a left bending ready stance B toward D.\n",
      "21": " Step 20. Execute a high back piercing kick to C with the right foot. Perform in slow motion.\n",
      "22": " Step 21. Lower the right foot to C to form a left walking stance toward D while executing a middle punch to D with the right fist.\n",
      "23": " Step 22. Turn the face to C while forming a right bending ready stance B toward D.\n",
      "24": " Step 23. Execute a high back piercing kick to C with the left foot. Perform in slow motion.\n",
      "25": " Step 24. Lower the left foot to C to form a right walking stance toward D while executing a middle punch to D with the left fist.\n",
      "26": " Step 25. Slide to C forming a right rear foot stance toward D while executing a downward block with the left palm.\n",
      "27": " Step 26. Execute a middle side front snap kick to D with the left foot keeping the position of the hands as they were in 25.\n",
      "28": " Step 27. Lower the left foot to D and then move the right foot to C in a stamping motion to form a sitting stance toward A while executing a middle side strike to C with the right side fist.\n",
      "29": " Step 28. Slide to C maintaining a sitting stance toward A while executing a scooping block with the left palm.\n",
      "30": " Step 29. Execute a middle punch to A with the right fist while maintaining a sitting stance toward A. Perform 28 and 29 in a connecting motion.\n",
      "31": " Step 30. Execute a low side block to D with the left knife-hand while maintaining a sitting stance toward A.\n",
      "32": " Step 31. Move the left foot just beyond the right foot in a quick motion while executing a middle side pushing kick to C with the right foot.\n",
      "33": " Step 32. Lower the right foot to C and then execute a high reverse turning kick to C with the left foot.\n",
      "34": " Step 33. Lower the left foot to C to form a left walking stance toward C while executing a high side block to C with the left knife-hand.\n",
      "35": " Step 34. Slide to D forming a left rear foot stance toward C while executing a downward block with the right palm.\n",
      "36": " Step 35. Execute a middle side front snap kick to C with the right foot keeping the position of the hands as they were in 34.\n",
      "37": " Step 36. Lower the right foot to C and then move the left foot to D in a stamping motion to form a sitting stance toward A while executing a middle side strike to D with the left side fist.\n",
      "38": " Step 37. Slide to D maintaining a sitting stance toward A while executing a scooping block with the right palm.\n",
      "39": " Step 38. Execute a middle punch to A with the left fist while maintaining a sitting stance toward A. Perform 37 and 38 in a connecting motion.\n",
      "40": " Step 39. Execute a low side block to C with the right knife-hand while maintaining a sitting stance toward A.\n",
      "41": " Step 40. Move the right foot just beyond the left foot in a quick motion while executing a middle side pushing kick to D with the left foot.\n",
      "42": " Step 41. Lower the left foot to D and then execute a high reverse turning kick to D with the right foot.\n",
      "43": " Step 42. Lower the right foot to D to form a right walking stance toward D while executing a high side block to D with the right knife-hand.\n",
      "44": " Step 43. Move the left foot to D and then execute a high twisting kick to AD with the right foot.\n",
      "45": " Step 44. Lower the right foot to C forming a left walking stance toward D while executing a side back strike to C with the right back fist and extending the left fist to D.\n",
      "46": " Step 45. Execute a front strike to D with the right back fist while shifting to C maintaining a left walking stance toward D.\n",
      "47": " Step 46. Move the right foot to D and then execute a high twisting kick to BD with the left foot.\n",
      "48": " Step 47. Lower the left foot to C to form a right walking stance toward D while executing a side back strike to C with the left back fist and extending the right fist to D.\n",
      "49": " Step 48. Execute a front strike to D with the left back fist while shifting to C maintaining a right walking stance toward D.\n",
      "50": " Step 49. Execute a sweeping kick to D with the left side sole keeping the position of the hands as they were in 48 and then lower it to D forming a right L-stance toward D while executing a middle guarding block to D with the forearm.\n",
      "51": " Step 50. Execute a side checking kick to D and then again a middle side thrusting kick to D with the left foot forming a forearm guarding block. Perform in a consecutive kick.\n",
      "52": " Step 51. Lower the left foot to D forming a right L-stance toward D while executing a middle outward strike to D with the left knife-hand.\n",
      "53": " Step 52. Execute a sweeping kick to D with the right side sole and then lower it to D to form a left L-stance toward D while executing a middle guarding block to D with the forearm.\n",
      "54": " Step 53. Execute a side checking kick to D and then again a middle side thrusting kick to D with the right foot forming a forearm guarding block. Perform in a consecutive kick.\n",
      "55": " Step 54. Lower the right foot to D forming a left L-stance toward D while executing a middle outward strike to D with the right knife-hand.\n",
      "56": " Step 55. Move the right foot to C and then turn counter clockwise pivoting with the right foot to form a left walking stance toward C while executing a middle punch to C with the right fist.\n",
      "57": " Step 56. Jump to C to form a right X-stance toward AC while executing a low punch to C with the left fist and bringing the right fist on the left shoulder.\n",
      "58": " Step 57. Jump to D forming a left X-stance toward AD while executing a low punch to D with the right fist and bringing the left fist on the right shoulder.\n",
      "59": " Step 58. Jump to execute a mid-air kick to D with the right foot while spinning clockwise.\n",
      "60": " Step 59. Land to D to form a left L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
      "61": " Step 60. Move the right foot to the side rear of the left foot and then the left foot to C to form a right walking stance toward D while executing a rising block with the left arc-hand.\n",
      "62": " Step 61. Execute a high punch to D with the right fist while maintaining a right walking stance toward D.\n",
      "63": " End: Bring the foot back to a ready position\n"
    },
    "title": " Moon-Moo "
  }
}