{
  "curPatternObj": {
    "patternSteps": {
      "0": " Number of Moves: 24\n",
      "1": " Ready Posture: Closed Ready Stance B\n",
      "2": " Step 1. Move the left foot to B, forming a left walking stance toward B at the same time executing a low block to B with the left forearm.\n",
      "3": " Step 2. Bring the left foot to the right foot, and then move the right foot to A to form a left L-stance toward A while executing a twin forearm block.\n",
      "4": " Step 3. Execute a middle side piercing kick to D with the right foot.\n",
      "5": " Step 4. Lower the right foot to D, and then move the left foot to F to form a left walking stance toward F while executing a rising block with the left forearm.\n",
      "6": " Step 5. Bring the left foot to the right foot, and then move the right foot to E to form a sitting stance toward D while executing a middle strike to E with the right knife-hand.\n",
      "7": " Step 6. Bring the right foot to the left foot, forming a closed ready stance B toward D.\n",
      "8": " Step 7. Jump to D to form a left X-stance toward DG while executing a high side strike to D with the left back fist, bringing the right finger belly to the left side fist.\n",
      "9": " Step 8. Move the right foot to G, forming a right walking stance toward G while executing a high punch to G with the right fist.\n",
      "10": " Step 9. Move the right foot on line GH to form a left fixed stance toward H while executing a high guarding block to H with the forearm.\n",
      "11": " Step 10. Move the right foot to H, forming a right walking stance toward H while executing a middle thrust to H with the right straight finger tip.\n",
      "12": " Step 11. Bring the right foot to the left foot, and then move the left foot to G to form a left walking stance toward G while executing a high side strike to G with the left back fist.\n",
      "13": " Step 12. Move the left foot on line GH to form a sitting stance toward C while executing a scooping block with the left palm.\n",
      "14": " Step 13. Execute a middle turning kick to C with the left foot.\n",
      "15": " Step 14. Lower the left foot to C in a jumping motion, forming a left X-stance toward CF while executing a high block to C with the left double forearm.\n",
      "16": " Step 15. Move the right foot to F to form a sitting stance toward C while extending the right fist horizontally to C. Perform in a slow motion.\n",
      "17": " Step 16. Execute a front strike to C with the left back fist while maintaining a sitting stance toward C.\n",
      "18": " Step 17. Bring the right foot behind the left foot, and then move the left foot to E, forming a left diagonal stance toward C while executing a pressing block with a twin palm.\n",
      "19": " Step 18. Execute a middle block to C with a double arc-hand while forming a left walking stance toward CE.\n",
      "20": " Step 19. Pull the left reverse footsword to the right knee joint to form a right one-leg stance toward C at the same time executing a high side block to F with the right outer forearm and a low side block to E with the left forearm.\n",
      "21": " Step 20. Lower the left foot to D forming a right walking stance toward C while executing a pressing block with the right palm. Perform in a slow motion.\n",
      "22": " Step 21. Pull the left instep to the hollow of the right leg to form a right one-leg stance toward C while striking the left palm with the right back forearm.\n",
      "23": " Step 22. Lower the left foot to C, turning clockwise to form a right fixed stance toward D while thrusting to C with the left side elbow.\n",
      "24": " Step 23. Move the right foot to A, forming a left L-stance toward A while executing a high guarding block to A with a knife-hand.\n",
      "25": " Step 24. Bring the right foot to the left foot, and then move the left foot to B to form a right L-stance toward B while executing a middle punch to B with the right fist.\n",
      "26": " End: Bring the foot back to a ready position\n"
    },
    "title": " Se-Jong "
  }
}