{
  "curPatternObj": {
    "patternSteps": {
      "0": " Number of Moves: 37\n",
      "1": " Ready Posture: Closed Ready Stance B\n",
      "2": " Step 1. Move the left foot to B forming a right L-stance toward B while executing a middle block to B with the left inner forearm.\n",
      "3": " Step 2. Execute a low thrust to B with the right upset finger tip while forming a left walking stance toward B, slipping the left foot to B.\n",
      "4": " Step 3. Bring the left foot to the right foot to form a closed stance toward D while executing a side back strike to C with the right back fist, extending the left arm to the side downward. Perform in slow motion.\n",
      "5": " Step 4. Move the right foot to A forming a left L-stance toward A while executing a middle block to A with the right inner forearm.\n",
      "6": " Step 5. Execute a low thrust to A with the left upset finger tip while forming a right walking stance toward A, slipping the right foot to A.\n",
      "7": " Step 6. Bring the right foot to the left foot to form a closed stance toward D while executing a side back strike to C with the left back fist, extending the right arm to the side downward. Perform in slow motion.\n",
      "8": " Step 7. Move the left foot to D forming a left walking stance toward D while executing a pressing block with an X-fist.\n",
      "9": " Step 8. Execute a high vertical punch to D with a twin fist while maintaining a left walking stance toward D. Perform 7 and 8 in a continuous motion.\n",
      "10": " Step 9. Execute a middle front snap kick to D with the right foot, keeping the position of the hands as they were in 8.\n",
      "11": " Step 10. Lower the right foot to D forming a right walking stance toward D while executing a middle punch to D with the right fist.\n",
      "12": " Step 11. Execute a middle punch to D with the left fist while maintaining a right walking stance toward D.\n",
      "13": " Step 12. Bring the left foot to the right foot forming a closed stance toward F while executing a twin side elbow thrust. Perform in slow motion.\n",
      "14": " Step 13. Move the right foot to F in a stamping motion forming a sitting stance toward C while executing a W-shape block to C with the right outer forearm.\n",
      "15": " Step 14. Move the left foot to F in a stamping motion turning clockwise to form a sitting stance toward D while executing a W-shape block to D with the left outer forearm.\n",
      "16": " Step 15. Move the left foot to E in a stamping motion turning clockwise to form a sitting stance toward C while executing a W-shape block to C with the left outer forearm.\n",
      "17": " Step 16. Move the right foot to E in a stamping motion turning counter clockwise to form a sitting stance toward D while executing a W-shape block to D with the right outer forearm.\n",
      "18": " Step 17. Move the left foot to E in a stamping motion turning clockwise to form a sitting stance toward C while executing a W-shape block to C with the left outer forearm.\n",
      "19": " Step 18. Move the left foot to F in a stamping motion turning clockwise to form a sitting stance toward D while executing a W-shape block to D with the left outer forearm.\n",
      "20": " Step 19. Bring the right foot to the left foot and then move the left foot to D forming a right L-stance toward D while executing a low pushing block to D with the left double forearm.\n",
      "21": " Step 20. Extend both hands upward as if to grab the opponent's head while forming a left walking stance toward D, slipping the left foot to D.\n",
      "22": " Step 21. Execute an upward kick with the right knee while pulling both hands downward.\n",
      "23": " Step 22. Lower the right foot to the left foot and then move the left foot to C forming a right L-stance toward C while executing a middle guarding block to C with a knife-hand.\n",
      "24": " Step 23. Execute a low side front snap kick to C with the left foot, keeping the position of the hands as they were in 22.\n",
      "25": " Step 24. Lower the left foot to C forming a left walking stance toward C while executing a high thrust to C with the left flat finger tip\n",
      "26": " Step 25. Move the right foot to C forming a left L-stance toward C while executing a middle guarding block to C with a knife-hand.\n",
      "27": " Step 26. Execute a low side front snap kick to C with the right foot, keeping the position of the hands as they were in 25.\n",
      "28": " Step 27. Lower the right foot to C forming a right walking stance toward C while executing a high thrust to C with the right flat finger tip.\n",
      "29": " Step 28. Move the right foot to D forming a right L-stance toward C while executing a side back strike to D with the right back fist and a low block to C with the left forearm.\n",
      "30": " Step 29. Jump to C forming a right X-stance toward A while executing a pressing block with an X-fist.\n",
      "31": " Step 30. Move the right foot to C forming a right walking stance toward C while executing a high block to C with the right double forearm.\n",
      "32": " Step 31. Move the left foot to B forming a right L-stance toward B while executing a low guarding block to B with a knife-hand.\n",
      "33": " Step 32. Execute a circular block to BD with the right inner forearm while forming a left walking stance toward B, slipping the left foot to B.\n",
      "34": " Step 33. Bring the left foot to the right foot and then move the right foot to A forming a left L-stance toward A, at the same time executing a low guarding block to A with a knife-hand.\n",
      "35": " Step 34. Execute a circular block to AD with the left inner forearm while forming a right walking stance toward A, slipping the right foot to A.\n",
      "36": " Step 35. Execute a circular block to CE with the right inner forearm while forming a left walking stance toward CE.\n",
      "37": " Step 36. Execute a circular block to AD with the left inner forearm while forming a right walking stance toward A.\n",
      "38": " Step 37. Move the right foot on line AB to form a sitting stance toward D while executing a middle punch to D with the right fist.\n",
      "39": " End: Bring the foot back to a ready position\n"
    },
    "title": " Toi-Gye "
  }
}