{
  "curPatternObj": {
    "patternSteps": {
      "0": " Number of Moves: 56\n",
      "1": " Ready Posture: Parallel Stance with an Overlapped Back Hand\n",
      "2": " Step 1. Move the right foot to C to form a left walking stance toward D while executing a middle punch to D with a twin fist. Perform in slow motion.\n",
      "3": " Step 2. Move the left foot to C to form a right walking stance toward D while executing a horizontal strike with a twin knife-hand. Perform in slow motion.\n",
      "4": " Step 3. Move the left foot to D, forming a right rear foot stance toward D while executing a middle inward block to D with the left outer forearm.\n",
      "5": " Step 4. Execute a low inward block to D with the right palm while forming a left walking stance toward D, slipping the right foot, and bringing the left side fist in front of the right shoulder.\n",
      "6": " Step 5. Move the right foot to D, forming a left L-stance toward D while executing a middle punch to D with the right fist.\n",
      "7": " Step 6. Execute a middle punch to D with the left fist while maintaining a left L-stance toward D. Perform 5 and 6 in a fast motion.\n",
      "8": " Step 7. Move the left foot to Din a stamping motion to form a right L-stance toward D while executing a high outward strike to D with the left back hand.\n",
      "9": " Step 8. Execute an inward vertical kick to the left palm with the right reverse footsword.\n",
      "10": " Step 9. Lower the right foot to D in a stamping motion, forming a left L-stance toward D while executing a high outward strike to D with the right back hand.\n",
      "11": " Step 10. Execute an inward vertical kick to the right palm with the left reverse footsword.\n",
      "12": " Step 11. Lower the left foot to D, and then execute a horizontal block with a twin palm while forming a right L-stance toward D, slipping the left foot. Perform in a slow motion.\n",
      "13": " Step 12. Move the right foot to D, forming a right walking stance toward D while executing a high side block to D with the right reverse knife-hand. Perform in a slow motion.\n",
      "14": " Step 13. Execute a middle side block to D with the left reverse knife-hand while maintaininga right walking stance toward D. Perform in a slow motion.\n",
      "15": " Step 14. Execute a middle punch to D with the right fist while maintaining a right walking stance toward D.\n",
      "16": " Step 15. Execute a middle punch to D with the left fist while maintaining a right walking stance toward D.\n",
      "17": " Step 16. Execute a downward kick to AC with the right foot, keeping the position of the hands as they were in 15.\n",
      "18": " Step 17. Lower the right foot to C in a stamping motion, forming a left L-stance toward C while executing a downward strike to C with the right back fist.\n",
      "19": " Step 18. Execute an outward vertical kick to BC with the left foot, keeping the position of the hands as they were in 17.\n",
      "20": " Step 19. Lower the left foot to C in a stamping motion to form a right L-stance toward C while executing a downward strike to C with the left back fist.\n",
      "21": " Step 20. Execute a high punch to D with the left fist while forming a right walking stance toward D, pivoting with the left foot.\n",
      "22": " Step 21. Execute a high punch to D with the right fist while maintaining a right walking stance toward D. Perform 20 and 21 in a fast motion.\n",
      "23": " Step 22. Move the left foot to D, forming a right rear foot stance toward D while executing an upward block with the left bow wrist.\n",
      "24": " Step 23. Move the right foot to D to form a left rear foot stance toward D while executing an upward block with the right bow wrist.\n",
      "25": " Step 24. Move the left foot to C, forming a left walking stance toward C while executing a pressing block with the left palm.\n",
      "26": " Step 25. Move the right foot to C to form a right walking stance toward C while executing a pressing block with the right palm. Perform 24 and 25 in a slow motion.\n",
      "27": " Step 26. Bring the left foot to the right foot to form a closed stance toward C while bringing both back hands in front of the lower abdomen in a circular motion, hitting the left palm with the right knife-hand.\n",
      "28": " Step 27. Move the left foot to D, forming a left walking stance toward D while executing a rising block with the left knife-hand.\n",
      "29": " Step 28. Execute a high punch to D with the right fist while maintaining a left walking stance toward D.\n",
      "30": " Step 29. Slide to D to form a left L-stance toward D while executing an upset punch to D with the left fist, bringing the right side fist in front of the left shoulder.\n",
      "31": " Step 30. Move the right foot to C, forming a left walking stance toward D while executing a high thrust with the right angle fingertip.\n",
      "32": " Step 31. Move the left foot on line CD to form a right walking stance toward C while executing a rising block with the right knife-hand.\n",
      "33": " Step 32. Execute a high punch to C with the left fist while maintaining a right walking stance toward C.\n",
      "34": " Step 33. Slide to C to form a right L-stance toward C while executing an upset punch to C with the right fist, bringing the left side fist in front of the right shoulder.\n",
      "35": " Step 34. Move the left foot to D, forming a right walking stance toward C while executing a high thrust with the left angle fingertip.\n",
      "36": " Step 35. Execute a low guarding block to C with a reverse knife-hand in a circular motion while forming a left L-stance toward C, pivoting with the left foot.\n",
      "37": " Step 36. Execute a low guarding block to D with a reverse knife-hand in a circular motion while forming a right L-stance toward D, pivoting with the right foot.\n",
      "38": " Step 37. Execute a low block to D with the right forearm and a middle outward block to D with the left knife-hand while forming a left walking stance toward D, slipping the left foot.\n",
      "39": " Step 38. Move the right foot to D in a stamping motion to form a right walking stance toward D at the same time executing a high vertical punch to D with a twin fist.\n",
      "40": " Step 39. Pull the right reverse footsword to the left knee joint, forming a left one-leg stance toward D while striking the left palm with the right back forearm.\n",
      "41": " Step 40. Execute a middle back piercing kick to C with the right foot, pulling both hands in the opposite direction.\n",
      "42": " Step 41. Lower the right foot to C to form a sitting stance toward A while executing a W-shape block with the outer forearm.\n",
      "43": " Step 42. Slide to C maintaining a sitting stance toward A while executing a W-shape block with the outer forearm.\n",
      "44": " Step 43. Move the right foot to D in a stamping motion, turning counter clockwise to form a sitting stance toward B while executing a W-shape block with the outer forearm.\n",
      "45": " Step 44. Slide to C, maintaining a sitting stance toward B while executing a W-shape block with the outer forearm.\n",
      "46": " Step 45. Pull the left reverse footsword to the right knee joint, forming a right one-leg stance toward C while striking the right palm with the left back forearm.\n",
      "47": " Step 46. Execute a high back piercing kick to D with the left foot, pulling both hands in the opposite direction.\n",
      "48": " Step 47. Lower the left foot to C in a jumping motion, forming a left X-stance toward C while executing a pressing block with an X-fist.\n",
      "49": " Step 48. Move the right foot to D, forming a left walking stance toward C while executing a front strike with the left under fist.\n",
      "50": " Step 49. Move the right foot to C to form a right walking stance toward C while executing a front strike with the right under fist.\n",
      "51": " Step 50. Execute a middle pushing block to C with the left palm while maintaining a right walking stance toward C.\n",
      "52": " Step 51. Execute a circular block to A with the right knife-hand while forming a left walking stance toward AD.\n",
      "53": " Step 52. Move the left foot to C to form a left walking stance toward C while executing a middle pushing block to C with the right palm.\n",
      "54": " Step 53. Execute a circular block to B with the left knife-hand while forming a right walking stance toward BD.\n",
      "55": " Step 54. Execute a high side piercing kick to D with the right foot, forming a forearm guarding block, and then lower it to the left foot to form a closed stance toward D while executing a twin side back elbow thrust.\n",
      "56": " Step 55. Move the left foot to D, forming a sitting stance toward A while executing a middle side punch to D with the left fist.\n",
      "57": " Step 56. Execute a middle punch to D with the right fist while forming a left walking stance toward D, pivoting with the left foot.\n",
      "58": " End: Bring the foot back to a ready position\n"
    },
    "title": " Tong-Il "
  }
}