{
  "curPatternObj": {
    "patternSteps": {
      "0": " Number of Moves: 28\n",
      "1": " Ready Posture: Closed Ready Stance A\n",
      "2": " Step 1. Move the left foot to B forming a right L-stance toward B while executing a twin forearm block.\n",
      "3": " Step 2. Execute a high inward strike to B with the right knife-hand while bringing the left side fist in front of the right shoulder, maintaining a right L-stance toward B.\n",
      "4": " Step 3. Execute a middle punch to B with the left fist while forming a left fixed stance toward B, slipping the left foot to B.\n",
      "5": " Step 4. Bring the left foot to the right footand then move the right foot to A, forming a left L-stance toward A while executing a twin forearm block.\n",
      "6": " Step 5. Execute a high inward strike to A with the left knife-hand while bringing the right side fist in front of the left shoulder, maintaining a left L-stance toward A.\n",
      "7": " Step 6. Execute a middle punch to A with the right fist while forming a right fixed stance toward A, slipping the right foot to A.\n",
      "8": " Step 7. Bring the right foot to the left foot and then turn the face toward D while forming a right bending ready stance A toward D.\n",
      "9": " Step 8. Execute a middle side piercing kick to D with the left foot.\n",
      "10": " Step 9. Lower the left foot to D forming a right L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
      "11": " Step 10. Move the right foot to D forming a left L-stance toward D while executing a guarding block to D with a knife-hand.\n",
      "12": " Step 11. Move the left foot to D forming a right L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
      "13": " Step 12. Move the right foot to D forming a right walking stance toward D while executing a middle thrust to D with the right straight finger tip.\n",
      "14": " Step 13. Move the left foot to E turning counter clockwise to form a right L-stance toward E, at the same time executing a twin forearm block.\n",
      "15": " Step 14. Execute a high inward strike to E with the right knife-hand while bringing the left side fist in front of the right shoulder, maintaining a right L-stance toward E.\n",
      "16": " Step 15. Execute a middle punch to E with the left fist while forming a left fixed stance toward E, slipping the left foot to E.\n",
      "17": " Step 16. Bring the left foot to the right foot and then move the right foot to F, forming a left L-stance toward F while executing a twin forearm block.\n",
      "18": " Step 17. Execute a high inward strike to F with the left knife-hand while bringing the right side fist in front of the left shoulder, maintaining a left L-stance toward F.\n",
      "19": " Step 18. Execute a middle punch to F with the right fist while forming a right fixed stance toward F, slipping the right foot to F.\n",
      "20": " Step 19. Bring the right foot to the left foot and then move the left foot to C forming a left walkng stance toward C while executing a circular block to CF with the right inner forearm.\n",
      "21": " Step 20. Execute a low front snap kick to C with the right foot, keeping the position of the hands as they were in 19.\n",
      "22": " Step 21. Lower the right foot to C forming a right walking stance toward C while executing a middle punch to C with the left fist.\n",
      "23": " Step 22. Execute a circular block to CE with the left inner forearm while maintaining a right walking stance toward C.\n",
      "24": " Step 23. Execute a low front snap kick to C with the left foot, keeping the position of the hands as they were in 22.\n",
      "25": " Step 24. Lower the left foot to C forming a left walking stance toward C while executing a middle punch to C with the right fist.\n",
      "26": " Step 25. Turn the face toward C forming a left bending ready stance A toward C.\n",
      "27": " Step 26. Execute a middle side piercing kick to C with the right foot.\n",
      "28": " Step 27. Lower the right foot on line CD and then move the left foot to B, turning counter clockwise to form a right L-stance toward B, at the same time executing a middle guarding block to B with the forearm.\n",
      "29": " Step 28. Bring the left foot to the right foot and then move the right foot to A forming a left L-stance toward A while executing a middle guarding clock to A with the forearm.\n",
      "30": " End: Bring the foot back to a ready position.\n"
    },
    "title": " Won-Hyo "
  }
}