{
  "curPatternObj": {
    "patternSteps": {
      "0": " Number of Moves: 68\n",
      "1": " Ready Posture: Warrior Ready Stance B\n",
      "2": " Step 1. Move the left foot to B to form a sitting stance toward D while extending both elbows to the sides horizontally.\n",
      "3": " Step 2. Execute an angle punch to C with the left fist while sliding to A, maintaining a sitting stance toward D.\n",
      "4": " Step 3. Execute an angle punch to C with the right fist while sliding to B, maintaining a sitting stance toward D. Perform 2 and 3 in a fast motion.\n",
      "5": " Step 4. Execute a middle hooking block to D with the right palm while standing up toward D.\n",
      "6": " Step 5. Execute a middle punch to D with the left fist while forming a sitting stance toward D.\n",
      "7": " Step 6. Execute a middle hooking block to D with the left palm while standing up toward D.\n",
      "8": " Step 7. Execute a middle punch to D with the right fist while forming a sitting stance toward D.\n",
      "9": " Step 8. Move the left foot to BD to form a left walking stance toward BD while executing a high side block to BD with the left outer forearm.\n",
      "10": " Step 9. Execute a circular block to D with the right inner forearm while maintaining a left walking stance toward BD.\n",
      "11": " Step 10. Execute a scooping block with the left palm while forming a sitting stance toward AD.\n",
      "12": " Step 11. Execute a middle punch to AD with the right fist while maintaining a sitting stance toward AD. Perform 10 and 11 in a connecting motion.\n",
      "13": " Step 12. Bring the left foot to the right foot, and then move the right foot to AD to form a right walking stance toward AD while executing a high side block to AD with the right outer forearm.\n",
      "14": " Step 13. Execute a circular block to D with the left inner forearm while maintaining a right walking stance toward AD.\n",
      "15": " Step 14. Execute a scooping block with the right palm while forming a sitting stance toward BD.\n",
      "16": " Step 15. Execute a middle punch to BD with the left fist while maintaining a right walking stance toward BD. Perform 14 and 15 in a connecting motion.\n",
      "17": " Step 16. Execute a high hooking block to BC with the right palm while forming a left walking stance toward BC.\n",
      "18": " Step 17. Execute a middle punch to BD with the left fist while forming a sitting stance toward BD.\n",
      "19": " Step 18. Execute a high hooking block to AD with the left palm while forming a right walking stance toward AD.\n",
      "20": " Step 19. Execute a middle punch to BD with the right fist while forming sitting stance toward BD. Perform 16, 17, 18 and 19 in a continuous motion.\n",
      "21": " Step 20. Move the right foot to C, forming a left walking stance toward D at the same time executing a pressing block with an X-fist.\n",
      "22": " Step 21. Execute a rising block with an X-knife-hand while maintaining a left walking stance toward D. Perform 20 and 21 in a continuous motion.\n",
      "23": " Step 22. Execute a middle punch to D with the right fist, slipping the left palm up to the right elbow joint while maintaining a left walking stance toward D.\n",
      "24": " Step 23. Execute a low front snap kick to D with the right foot, keeping the position of the hands as they were in 22.\n",
      "25": " Step 24. Lower the right foot to D, forming a right walking stance toward D while executing a middle punch to D with the left fist.\n",
      "26": " Step 25. Execute a pressing block with an X-fist while maintaining a right walking stance toward D.\n",
      "27": " Step 26. Execute a rising block with an X-knife-hand while maintaining a right walking stance toward D. Perform 25 and 26 in a continuous motion.\n",
      "28": " Step 27. Execute a middle punch to D with the left fist slipping the right palm up to the left elbow joint while maintaining a right walking stance toward D.\n",
      "29": " Step 28. Execute a low front snap kick to D with the left foot, keeping the position of the hands as they were in 27.\n",
      "30": " Step 29. Lower the left foot to D to form a left walking stance toward D while executing a middle punch to D with the right fist.\n",
      "31": " Step 30. Move the right foot to D, forming a left L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
      "32": " Step 31. Move the left foot to D to form a right L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
      "33": " Step 32. Move the left foot to C, forming a left L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
      "34": " Step 33. Move the right foot to C to form a right L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
      "35": " Step 34. Move the right foot to D, forming a right walking stance toward D while executing a high block to D with the right double forearm.\n",
      "36": " Step 35. Execute a low block to D with the left forearm, keeping the right forearm as it was in 34 while maintaining a right walking stance toward D. Perform 34 and 35 in a fast motion.\n",
      "37": " Step 36. Move the left foot to D to form a left walking stance toward D while executing a high block to D with the left double forearm.\n",
      "38": " Step 37. Execute a low block to D with the right forearm, keeping the left forearm as it was in 36 while maintaining a left walking stance toward D. Perform 36 and 37 in a fast motion.\n",
      "39": " Step 38. Move the right foot to D, forming aright walking stance toward D while executing a middle punch to D with the right fist.\n",
      "40": " Step 39. Move the left foot on line CD, and then turn counter-clockwise, pivoting with the left foot to form a right L-stance toward C while executing a high block to C with the left reverse knife-hand.\n",
      "41": " Step 40. Bring the right foot to the left foot to form a closed ready stance C toward C.\n",
      "42": " Step 41. Move the right foot to CF in a stamping motion to form a right walking stance toward CF at the same time executing an upset punch to CF with a twin fist.\n",
      "43": " Step 42. Bring the right foot to the left foot, and then move the left foot to CE in a stamping motion, forming a left walking stance toward CE while executing an upset punch to CE with a twin fist.\n",
      "44": " Step 43. Bring the left foot to the right foot, and then move the right foot to F to form a left L-stance toward F while executing a middle block to F with the right inner forearm.\n",
      "45": " Step 44. Execute a middle punch to F with the left fist while maintaining a left L-stance toward F.\n",
      "46": " Step 45. Bring the left foot to the right foot to form a closed stance toward C while executing an angle punch with the right fist. Perform in a slow motion.\n",
      "47": " Step 46. Move the left foot to E to form a right L-stance toward E while executing a middle block to E with the left inner forearm.\n",
      "48": " Step 47. Execute a middle punch to E with the right fist while maintaining a right L-stance toward E.\n",
      "49": " Step 48. Bring the right foot to the left foot to form a close stance toward C while executing an angle punch with the left fist. Perform in a slow motion.\n",
      "50": " Step 49. Move the left foot to E to form a left fixed stance toward E while executing a U-shape punch to E.\n",
      "51": " Step 50. Bring the left foot to the right foot, and then move the right foot to E, forming a right fixed stance toward E while executing a U-shape punch to E.\n",
      "52": " Step 51. Move the right foot on line CD in a stamping motion to form a sitting stance toward E while executing a front strike to E with the right back fist.\n",
      "53": " Step 52. Execute a waving kick to D with the right foot, and then a high outward block to AC with the right outer forearm, keeping the position of the hands as they were in 51 while forming a sitting stance toward E.\n",
      "54": " Step 53. Execute a waving kick to C with the left foot, and then a high front block to ED with the right outer forearm, keeping the position of the hands as they were in 52 while forming a sitting stance toward E.\n",
      "55": " Step 54. Execute a horizontal strike to C with the right back hand while maintaining a sitting stance toward E.\n",
      "56": " Step 55. Execute a middle crescent kick to the right palm with the left foot.\n",
      "57": " Step 56. Execute a middle side piercing kick to C with the left foot forming a forearm guarding block. Perform 55 and 56 in a consecutive kick.\n",
      "58": " Step 57. Lower the left foot to C to form a sitting stance toward B while executing a horizontal strike to C with the left back hand.\n",
      "59": " Step 58. Execute a middle crescent kick to the left palm with the right foot.\n",
      "60": " Step 59. Execute a middle side piercing kick to C with the right foot, forming a forearm guarding block. Perform 58 and 59 in a consecutive kick.\n",
      "61": " Step 60. Lower the right foot to C, forming a sitting stance toward A while executing a right 9-shape block.\n",
      "62": " Step 61. Change the position of the hands while maintaining a sitting stance toward A.\n",
      "63": " Step 62. Move the left foot to C, turning clockwise to form a sitting stance toward B while executing a right 9-shape block.\n",
      "64": " Step 63. Change the position of the hands while maintaining a sitting stance toward B.\n",
      "65": " Step 64. Execute a downward strike to D with the right side fist while forming a left vertical stance toward, pulling the left foot.\n",
      "66": " Step 65. Move the right foot to A to form a left walking stance toward B while executing a high vertical punch to B with a twin fist.\n",
      "67": " Step 66. Move the right foot to B, turning counter-clockwise to form a left walking stance toward A while executing a high vertical punch to A with a twin fist.\n",
      "68": " Step 67. Bring the right foot to the left foot, and ten move the left foot to BD to form a right L-stance toward BD while executing a middle guarding block to BD with a knife-hand.\n",
      "69": " Step 68. Bring the left foot to the right foot, and then move the right foot to AD to form a left L-stance toward AD while executing a middle guarding block to AD with a knife-hand.\n",
      "70": " End: Bring the foot back to a ready position\n"
    },
    "title": " Yoo-Sin "
  }
}