{
  "curPatternObj": {
    "0": " Number of Moves: 52\n",
    "1": " Ready Posture: Closed Ready Stance A\n",
    "2": " Step 1. Move the right foot to A to form a sitting stance toward D while executing a side front block with the right inner forearm and extending the left forearm side-downward.\n",
    "3": " Step 2. Execute a side front block with the left inner forearm extending the right forearm side downward while maintaining a sitting stance toward D.\n",
    "4": " Step 3. Bring the right foot to the left foot forming a closed stance toward D while executing an angle punch with the left fist. Perform in slow motion.\n",
    "5": " Step 4. Move the left foot to D to form a left walking stance toward while executing a high thrust to D with the right double finger.\n",
    "6": " Step 5. Move the right foot to D to form a right walking stance toward while executing a high thrust to D with the left double finger.\n",
    "7": " Step 6. Execute a front strike to D with the right back fist while maintaining a right walking stance toward D.\n",
    "8": " Step 7. Move the left foot to D forming a left walking stance toward D while executing a rising block with the left forearm.\n",
    "9": " Step 8. Move the right foot to D to form a right walking stance toward D at the same time executing a middle punch to D with the right fist.\n",
    "10": " Step 9. Move the right foot to C turning counter clockwise and then slide to C to form a right L-stance toward D while executing a middle guarding block to D with the forearm.\n",
    "11": " Step 10. Execute a low front snap kick to D with the right foot keeping the position of the hands as they were in 9.\n",
    "12": " Step 11. Lower the right foot to D forming a right low stance toward D while executing a high thrust to D with the right flat finger tip.\n",
    "13": " Step 12. Execute a high turning kick to D with the right foot supporting the body with both hands and the left knee.\n",
    "14": " Step 13. Lower the right foot to D and then execute a high punch to D with the right fist while pressing the ground with the left palm.\n",
    "15": " Step 14. Move the left foot to D turning clockwise to form a left L-stance toward C while thrusting to D with the left side elbow.\n",
    "16": " Step 15. Move the left foot to C turning clockwise to form a left L-stance toward D at the same time executing a middle guarding block to D with the forearm.\n",
    "17": " Step 16. Move the right foot to C forming a right L-stance toward D while executing a scooping block with the left palm.\n",
    "18": " Step 17. Move the left foot to C forming a left L-stance toward D while executing a middle outward strike to D with the right knife-hand.\n",
    "19": " Step 18. Execute a pressing block with an X-fist while forming a left walking stance toward C pivoting with the right foot.\n",
    "20": " Step 19. Execute a low front snap kick to C with the right knee while pulling both hands in the opposite direction as if grabbing the opponent's leg.\n",
    "21": " Step 20. Lower the right foot to C forming a right L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
    "22": " Step 21. Move the right foot to D in a sliding motion to form a right L-stance toward C while thrusting to D with the right side elbow.\n",
    "23": " Step 22. Execute a middle guarding block to D with a knife-hand while forming a left L-stance toward D pivoting with the left foot.\n",
    "24": " Step 23. Execute a middle side piercing kick to D with the right foot while pulling both hands in the opposite direction.\n",
    "25": " Step 24. Lower the right foot to D and then execute a pressing block with a twin palm while forming a right rear foot stance toward C, pivoting with the right foot.\n",
    "26": " Step 25. Move the right foot to C to form a right walking stance toward C while executing a high front block to C with the right outer forearm and then a high side strike to C with the right back fist, maintaining a right walking stance toward C.\n",
    "27": " Step 26. Execute a high thrust to D with the left flat finger tip while forming a right L-stance toward D pivoting with the right foot.\n",
    "28": " Step 27. Execute a low front snap kick to D with the right foot while bring the right palm on the left back hand.\n",
    "29": " Step 28. Lower the right foot to D to form a left walking stance toward C pivoting with the left foot while thrusting to D with the right back elbow, placing the left side fist on the right fist. Perform in slow motion.\n",
    "30": " Step 29. Execute a downward strike with the left back hand while forming a right L-stance toward C, pivoting with the right foot. Perform in a stamping motion.\n",
    "31": " Step 30. Punch the left palm with the right fist while maintaining a right L-stance toward C.\n",
    "32": " Step 31. Move the right foot to C in a stamping motion to form a left L-stance toward C while executing a downward strike with the right back hand.\n",
    "33": " Step 32. Punch the right palm with the left fist while maintaining a left L-stance toward C.\n",
    "34": " Step 33. Execute a middle outward strike to D with the left knife-hand while forming a right L-stance toward D, pivoting with the right foot. Perform in a stamping motion.\n",
    "35": " Step 34. Execute a high side front strike to D with the right back fist striking the left palm with the right elbow while forming a left walking stance toward D, slipping the left foot.\n",
    "36": " Step 35. Move the right foot to D forming a left L-stance toward D while executing a middle outward strike to D with the right knife-hand. Perform in a stamping motion.\n",
    "37": " Step 36. Execute a high side front strike to D with the left back fist striking the right palm with the left elbow while forming a right walking stance toward D, slipping the right foot.\n",
    "38": " Step 37. Execute a low guarding block to C with a reverse knife-hand while forming a right L-stance toward C pivoting with the right foot.\n",
    "39": " Step 38. Execute a right 9-shape block while forming a left walking stance toward C slipping the left foot.\n",
    "40": " Step 39. Move the right foot to C forming a left L-stance toward C while executing a low guarding block to C with a reverse knife-hand.\n",
    "41": " Step 40. Execute a left 9-shape block while forming a right walking stance toward C slipping the right foot.\n",
    "42": " Step 41. Move the right foot to D forming a left walking stance toward C while executing a horizontal strike with a twin knife-hand.\n",
    "43": " Step 42. Execute a high strike to C with the right arc-hand while maintaining a left walking stance toward C.\n",
    "44": " Step 43. Execute a middle front snap kick to C with the right foot keeping the position of the hands as they were in 42.\n",
    "45": " Step 44. Lower the right foot to C forming a right walking stance toward C while executing a high strike to C with the left arc-hand.\n",
    "46": " Step 45. Execute a middle front snap kick to C with the left foot keeping the position of the hands as they were in 44.\n",
    "47": " Step 46. Lower the left foot to C forming a left walking stance toward C while executing a middle punch to C with the right fist.\n",
    "48": " Step 47. Execute a middle punch to C with the left fist while maintaining a left walking stance toward c. Perform 46 and 47 in a fast motion.\n",
    "49": " Step 48. Bring the right foot to the left foot to form a close stance toward C while executing a high crescent punch with a twin for-knuckle fist.\n",
    "50": " Step 49. Move the left foot to B turning counter-clockwise to form a left walking stance toward B while executing a low block to B with the left knife-hand.\n",
    "51": " Step 50. Execute a high punch to B with the right open fist while maintaining a left walking stance toward B.\n",
    "52": " Step 51. Move the left foot on line AB forming a right walking stance toward A while executing a low block to A with the right Knife-hand.\n",
    "53": " Step 52. Execute a high punch to A with the left open fist while maintaining a right walking stance toward A.\n",
    "54": " End: Bring the foot back to a ready position\n",
    "title": "Choong-JangEdit"
  }
}