{
  "curPatternObj": {
    "patternSteps": {
      "0": " Number of Moves: 45\n",
      "1": " Ready Posture: Closed Ready Stance D\n",
      "2": " Step 1. Move the right foot to C forming a left walking stance toward D while executing a low inward block to D with the right knife-hand.\n",
      "3": " Step 2. Move the left foot to C forming a right walking stance toward D while executing a high side block to D with the left outer forearm.\n",
      "4": " Step 3. Execute a middle punch to D with the right fist while maintaining a right walking stance toward D.\n",
      "5": " Step 4. Execute a low twisting kick to D with the left foot keeping the position of the hands as they were in 3.\n",
      "6": " Step 5. Lower the left foot to D forming a left walking stance toward D while executing a downward block with an x-fist.\n",
      "7": " Step 6. Execute a rising block with the right knife-hand, maintaining a left walking stance toward D. Perform 5 and 6 in a continuous motion.\n",
      "8": " Step 7. Jump to D, forming a right x-stance toward BD while executing a high side strike to D with the right back fist bringing the left finger belly to the right side fist.\n",
      "9": " Step 8. Move the left foot to C forming a right L-stance toward C while executing a middle punch to C with the left fist.\n",
      "10": " Step 9. Execute a middle reverse turning kick to AC with the right foot.\n",
      "11": " Step 10. Lower the right foot to C in a stamping motion to form a sitting stance toward A while executing a middle side strike to C with the right knife-hand.\n",
      "12": " Step 11. Execute a middle side piercing kick to C with the left foot while turning clockwise pulling both hands in the opposite direction.\n",
      "13": " Step 12. Lower the left foot to C forming a left walking stance toward C while executing a high crescent punch with the right fist.\n",
      "14": " Step 13. Execute a middle turning punch with the left fist while forming a parallel stance toward C pulling the right foot. Perform in slow motion.\n",
      "15": " Step 14. Move the left foot to D forming a right walking stance toward C while executing a low inward block with the left knife-hand.\n",
      "16": " Step 15. Move the right foot to D forming a left walking stance toward C at the same time executing a high side block to C with the right outer forearm.\n",
      "17": " Step 16. Execute a middle punch to C with the left fist while maintaining a left walking stance toward C.\n",
      "18": " Step 17. Execute a low twisting kick to C with the right foot, keeping the position of the hands as they were in 16.\n",
      "19": " Step 18. Lower the right foot to C forming a right waling stance toward C while executing a downward block with an x-fist.\n",
      "20": " Step 19. Execute a rising block with the left knife-hand while maintaining a right walking stance toward C. Perform 18 and 19 in a continuous motion.\n",
      "21": " Step 20. Jump to C forming a left x-stance toward BC while executing a high side strike to C with the left back fist and bringing the right finger belly to the left side fist.\n",
      "22": " Step 21. Move the right foot to D, forming a left L-stance toward D while executing a middle punch to D with the right fist.\n",
      "23": " Step 22. Execute a middle reverse turning kick to AD with the left foot.\n",
      "24": " Step 23. Lower the left foot to D in a stamping motion to form a sitting stance toward A at the same time executing a middle side strike to D with a left knife-hand.\n",
      "25": " Step 24. Execute a middle side piercing kick to D with the right foot while turning counter-clockwise pulling both hands in the opposite direction.\n",
      "26": " Step 25. Lower the right foot to D forming a right walking stance toward D while executing a high crescent punch with the left fist.\n",
      "27": " Step 26. Execute a middle turning punch with the right fist while forming a parallel stance toward D pulling the left foot. Perform in slow motion.\n",
      "28": " Step 27. Move the right foot to D forming a right walking stance toward D at the same time executing a middle wedging block with a knife-hand.\n",
      "29": " Step 28. Execute a circular block to BD with the left reverse knife-hand while maintaining a right walking stance toward D.\n",
      "30": " Step 29. Execute a downward block with an alternate palm while forming a left rear foot stance toward D pulling the right foot.\n",
      "31": " Step 30. Execute a middle punch to D with the left fist while forming a left L-stance toward D slipping the right foot.\n",
      "32": " Step 31. Execute a low inward block to D with the right reverse knife-hand while shifting to C maintaining a left L-stance toward D.\n",
      "33": " Step 32. Move the left foot to D forming a left walking stance toward D while executing a middle wedging block with a knife-hand.\n",
      "34": " Step 33. Execute a circular block to AD with the right reverse knife-hand while maintaining a left walking stance toward D.\n",
      "35": " Step 34. Execute a downward block with an alternate palm while forming a right rear foot stance toward D pulling left foot.\n",
      "36": " Step 35. Execute a middle punch to D with the right fist while forming a right L-stance toward D slipping the left foot.\n",
      "37": " Step 36. Execute a low inward block to D with the left reverse knife-hand while shifting to C maintaining a right L-stance toward D.\n",
      "38": " Step 37. Execute a high reverse turning kick to BD with the right foot.\n",
      "39": " Step 38. Lower the right foot to D forming a left rear foot stance toward D while executing a middle guarding block to D with the forearm.\n",
      "40": " Step 39. Execute a high reverse turning kick to AD with the left foot.\n",
      "41": " Step 40. Lower the left foot to D forming a right rear foot stance toward D while executing a middle guarding block to D with the forearm.\n",
      "42": " Step 41. Move the left foot to the side rear of the right foot and then the right foot to C forming a right L-stance toward D while executing a low outward block to D with the left knife-hand.\n",
      "43": " Step 42. Execute a middle punch to D with the right fist while forming a left walking stance toward D slipping the right foot.\n",
      "44": " Step 43. Move the left foot to C forming a left L-stance toward D while executing a low block to D with the right knife-hand.\n",
      "45": " Step 44. Execute a middle punch to D with the left fist while forming a right walking stance toward D slipping the left foot.\n",
      "46": " Step 45. Execute a high punch to D with the right fist while maintaining a right walking stance toward D.\n",
      "47": " End: Bring the foot back to a ready position\n"
    },
    "title": " Eui-Am "
  }
}