{
  "curPatternObj": {
    "0": " Number of Moves: 29\n",
    "1": " Ready Posture: Closed Ready Stance C\n",
    "2": " Step 1. Move the left foot to B to forma sitting stance toward D while executing a middle pushing block to D with the left palm.\n",
    "3": " Step 2. Execute a middle punch to D with the right fist while maintaining a sitting stance toward D.\n",
    "4": " Step 3. Execute a middle punch to D with the left fist while maintaining a sitting stance toward D.\n",
    "5": " Step 4. Execute a twin forearm block while forming a left L-stance toward A, pivoting with the let foot.\n",
    "6": " Step 5. Execute an upward punch with the left fist while pulling the right side fist in front of the left shoulder, maintaining a left L-stance toward A.\n",
    "7": " Step 6. Execute a middle punch to A with the right fist while forming a right fixed stance toward A in a sliding motion.\n",
    "8": " Step 7. Execute a downward strike with the right knife-hand while forming a left vertical stance toward A, pulling the right foot.\n",
    "9": " Step 8. Move the left foot to A forming a left walking stance toward A while executing a middle punch to A with the left fist.\n",
    "10": " Step 9. Move the left foot to D forming a left walking stance toward D while executing a low block to D with the left forearm.\n",
    "11": " Step 10. Move the right foot to D forming a right walking stance toward D while executing a middle punch to D with the right fist.\n",
    "12": " Step 11. Pull the left foot toward the right foot while bringing the left palm to the right forefist, at the same time bending the right elbow about 45 degrees outward.\n",
    "13": " Step 12. Execute a middle side piercing kick to D with the right foot while pulling both hands in the opposite direction and then lower it to D forming a left L-stance toward D, at the same time executing a middle outward strike to D with the right knife-hand.\n",
    "14": " Step 13. Move the left foot to D forming a left walking stance toward D while executing a middle punch to D with the left fist.\n",
    "15": " Step 14. Move the right foot to D forming a right walking stance toward D at the same time executing a middle punch to D with the right fist.\n",
    "16": " Step 15. Move the left foot to E turning counter clockwise to form a right L-stance toward E while executing a middle guarding block to E with a knife-hand.\n",
    "17": " Step 16. Move the right foot to E forming a right walking stance toward E while executing a middle thrust to E with the right straight finger tip.\n",
    "18": " Step 17. Move the right foot on line EF forming a right L-stance toward F while executing a middle guarding block to F with a knife-hand.\n",
    "19": " Step 18. Execute a high turning kick to DF with the right foot and then lower it to F.\n",
    "20": " Step 19. Execute a high turning kick to CF with the left foot and then lower it to F forming a right L-stance toward F while executing a middle guarding block to F with a knife-hand. Perform 18 and 19 in a fast motion..\n",
    "21": " Step 20. Move the left foot to C forming a left walking stance toward C while executing a low block to C with the left forearm.\n",
    "22": " Step 21. Execute a middle punch to C with the right fist while forming a right L-stance toward C, pulling the left foot.\n",
    "23": " Step 22. Move the right foot to C forming a left L-stance toward C while executing a middle punch to C with the left fist.\n",
    "24": " Step 23. Move the left foot to C forming a right L-stance toward C while executing a middle punch to C with the right fist.\n",
    "25": " Step 24. Execute a pressing block with an X-fist while forming a left walking stance toward C, slipping the left foot to C.\n",
    "26": " Step 25. Move the right foot to C in a sliding motion forming a right L-stance toward D while thrusting to C with the right side elbow.\n",
    "27": " Step 26. Bring the left foot to the right foot, turning counter clockwise to form a closed stance toward B while executing a side front block with the right inner forearm while extending the left forearm to the side downward.\n",
    "28": " Step 27. Execute a side front block with the left inner forearm, extending the right forearm to the side downward while maintaining a closed stance toward B..\n",
    "29": " Step 28. Move the left foot to B forming a right L-stance toward B at the same time executing a middle guarding block to B with a knife-hand.\n",
    "30": " Step 29. Bring the left foot to the right foot and then move the right foot to A forming a left L-stance toward A while executing a middle guarding block to A with a knife-hand.\n",
    "31": " End: Bring the foot back to a ready position\n",
    "title": "Hwa-RangEdit"
  }
}