{
  "curPatternObj": {
    "0": " Number of Moves: 45\n",
    "1": " Ready Posture: Parallel Stance with a Twin Elbow\n",
    "2": " Step 1. Move the left foot to B forming a sitting stance toward D while executing a parallel block with the inner forearm.\n",
    "3": " Step 2. Execute a middle hooking block to D with the right palm while standing up toward D.\n",
    "4": " Step 3. Execute a middle punch to D with the left fist while forming a sitting stance toward D.\n",
    "5": " Step 4. Pull the right reverse footsword to the left knee joint forming a left one-leg stance toward D while executing a parallel block with the outer forearm.\n",
    "6": " Step 5. Execute a middle side piercing kick to A and then a high reverse hooking kick to B consecutively with the right foot keeping the position of the hands as they were in 4. Perform in slow motion.\n",
    "7": " Step 6. Lower the right foot to B in a jumping motion to form a right X-stance toward F while executing a downward strike to B with the right back fist.\n",
    "8": " Step 7. Execute a middle hooking kick and then a high side piercing kick to F consecutively with the left foot while pulling both fists in front of the chest.\n",
    "9": " Step 8. Lower the left foot to F in a stamping motion to form a sitting stance toward B while executing a high outward cross-cut to F with the left flat finger tip.\n",
    "10": " Step 9. Execute a right high elbow strike to BF pressing the right side fist with the left palm while forming a left walking stance toward BF.\n",
    "11": " Step 10. Cross the left foot over the right foot to form a right X-stance toward B while executing a low front block to B with the left reverse knife-hand, bringing the right finger belly on the left back forearm.\n",
    "12": " Step 11. Move the right foot to A forming a left L-stance toward A while executing a middle guarding block to A with a knife-hand.\n",
    "13": " Step 12. Execute a mid-air strike to A with a left knife-hand while spinning counter clockwise and then land to A forming a right L-stance toward A with the left arm extended.\n",
    "14": " Step 13. Move the right foot to A to form a sitting stance toward D while executing a parallel block with the inner forearm.\n",
    "15": " Step 14. Execute a middle hooking block to D with the left palm while standing up toward D.\n",
    "16": " Step 15. Execute a middle punch to D with the right fist while forming a sitting stance toward D.\n",
    "17": " Step 16. Pull the left reverse footsword to the right knee joint forming a right one-leg stance toward D while executing a parallel block with the outer forearm.\n",
    "18": " Step 17. Execute a middle side piercing kick to B and then a high reverse hooking kick to A consecutively with the left foot keeping the position of the hands as they were in 16. Perform in slow motion.\n",
    "19": " Step 18. Lower the left foot to A in a jumping motion to form a left X-stance toward E while executing a downward strike to A with the left back fist.\n",
    "20": " Step 19. Execute a middle hooking kick and then a high side piercing kick to E consecutively with the right foot while pulling both fists in front of the chest.\n",
    "21": " Step 20. Lower the right foot to E in a stamping motion to form a sitting stance toward A while executing a high outward cross-cut to E with the right flat finger tip.\n",
    "22": " Step 21. Execute a left high elbow strike to AE pressing the left side fist with the right palm while forming a right walking stance toward AE.\n",
    "23": " Step 22. Cross the right foot over the left foot to form a left X-stance toward A while executing a low front block to A with the right reverse knife-hand, bringing the left finger belly on the right back forearm.\n",
    "24": " Step 23. Move the left foot to B forming a right L-stance toward B while executing a middle guarding block to B with a knife-hand.\n",
    "25": " Step 24. Execute a mid-air strike to B with a right knife-hand while spinning clockwise and then land to B forming a left L-stance toward B with the right arm extended.\n",
    "26": " Step 25. Execute a pick-shape kick to B with the left foot and then lower it to B forming a right rear foot stance toward B while executing a middle guarding block with the forearm.\n",
    "27": " Step 26. Stance toward B while executing a middle guarding block with the forearm. Bring the right foot to the left foot forming a closed stance with a heaven hand toward D Perform in slow motion.\n",
    "28": " Step 27. Slide to C to form a left rear foot stance toward D while executing a downward thrust with the right straight elbow.\n",
    "29": " Step 28. Execute a high crescent strike with the left arc-hand while forming a right walking stance toward D, slipping the right foot.\n",
    "30": " Step 29. Slide to C to form a right rear foot stance toward D while executing a downward thrust with the left straight elbow.\n",
    "31": " Step 30. Execute a high crescent strike with the right arc-hand while forming a left walking stance toward D, slipping the left foot.\n",
    "32": " Step 31. Move the left foot to C forming a right walking stance toward D while executing a high inward strike to D with a twin knife-hand.\n",
    "33": " Step 32. Move the right foot to C forming a left walking stance toward D while executing a downward punch with the right fist.\n",
    "34": " Step 33. Move the left foot to the side rear of the right foot and then slide to C forming a right L-stance toward D while executing a downward block with the left outer forearm.\n",
    "35": " Step 34. Execute a dodging reverse turning kick to D with the right foot while flying away from D and then land to C to form a left L-stance toward D at the same time executing a middle guarding block to D with the forearm.\n",
    "36": " Step 35. Move the right foot to the side rear of the left foot and then slide to C forming a left L-stance toward D while executing a downward block with the right outer forearm.\n",
    "37": " Step 36. Execute a dodging reverse turning kick to D with the left foot while flying away from D and then land to C to form a right L-stance toward D at the same time executing a middle guarding block to D with the forearm.\n",
    "38": " Step 37. Move the right foot to D and then the left foot to D then execute a flying two direction kick (twisting kick with the left foot, side piercing with the right foot) while flying to D.\n",
    "39": " Step 38. Land to D to form a left diagonal stance toward D while executing a rising block with a twin palm.\n",
    "40": " Step 39. Slide to D forming a right rear foot stance toward C while executing a side thrust to D with the right elbow.\n",
    "41": " Step 40. Turn the face to D while forming a right bending ready stance B toward C and then execute a middle back piercing kick to D with the left foot. Perform in slow motion.\n",
    "42": " Step 41. Lower the left foot to D in a stamping motion forming a right L-stance toward D at the same time executing a horizontal strike to D with the left back fist.\n",
    "43": " Step 42. Execute a high inward cross-cut to D with the right flat finger tip while forming a parallel stance toward D, pulling the right foot.\n",
    "44": " Step 43. Execute a front punch and an upset punch to D consecutively with the right fist while flying to D and then land to D forming a closed stance toward D with the right fist extended.\n",
    "45": " Step 44. Move the right foot to D forming a right walking stance toward D while executing a front downward strike with the left knife-hand.\n",
    "46": " Step 45. Move the left foot to D forming a left walking stance toward D while executing a middle punch to D with the right fist.\n",
    "47": " End: Bring the foot back to a ready position\n",
    "title": "JucheEdit"
  }
}