{
  "curPatternObj": {
    "0": " Number of Moves: 39\n",
    "1": " Ready Posture: Closed Ready Stance C\n",
    "2": " Step 1. Move the right foot to AC to form a sitting stance toward AD, at the same time executing a middle pushing block to AD with the left palm.\n",
    "3": " Step 2. Execute a middle punch to AD with the right fist, maintaining a sitting stance toward AD.\n",
    "4": " Step 3. Move the right foot on line CD, forming a right L-stance toward D while executing a middle guarding block to D with the forearm.\n",
    "5": " Step 4. Execute a low block to AD with the right outer forearm and a middle side block to D with the left inner forearm, maintaining a right L-stance toward D.\n",
    "6": " Step 5. Move the left foot to BC forming a sitting stance toward BD, at the same time executing a middle pushing block to BD with the right palm.\n",
    "7": " Step 6. Execute a middle punch to BD with the right fist, maintaining a sitting stance toward BD.\n",
    "8": " Step 7. Move the left foot on line CD, forming a left L-stance toward D while executing a middle guarding block to D with the forearm.\n",
    "9": " Step 8. Execute a low block to BD with the left outer forearm and a middle side block to D with the right inner forearm, maintaining a left L-stance toward D.\n",
    "10": " Step 9. Turn the face toward C forming a left bending ready stance B toward D.\n",
    "11": " Step 10. Execute a middle back piercing kick to C with the right foot.\n",
    "12": " Step 11. Lower the right foot to C, forming a right L-stance toward D while executing a middle block to D with the left knife hand.\n",
    "13": " Step 12. Turn the face toward C forming a right bending ready stance B toward D.\n",
    "14": " Step 13. Execute a middle back piercing kick to C with the left foot.\n",
    "15": " Step 14. Lower the left foot to C, forming a left L-stance toward D while executing a middle block to D with the right knife hand.\n",
    "16": " Step 15. Move the right foot to C, forming a right L-stance toward D while executing a downward thrust to D with the left straight elbow.\n",
    "17": " Step 16. Move the left foot to C, forming a left L-stance toward D while executing a downward thrust to D with the right straight elbow.\n",
    "18": " Step 17. Move the left foot to D to form a left walking stance toward D while executing a pressing block to D with the right palm.\n",
    "19": " Step 18. Move the right foot to D to form a right walking stance toward D while executing a pressing block to D with the left palm.\n",
    "20": " Step 19. Move the right foot to C forming a right L-stance toward D, while executing a downward block to D with the left outer forearm.\n",
    "21": " Step 20. Move the right foot to D forming a left L-stance toward D, while executing a downward block to D with the right outer forearm.\n",
    "22": " Step 21. Move the left foot to D, forming a right rear foot stance toward D, at the same time executing an upward block to D with the left palm.\n",
    "23": " Step 22. Move the right foot to D, forming a left rear foot stance toward D, at the same time executing an upward block to D with the right palm.\n",
    "24": " Step 23. Middle side front snap kick to D with the left foot, keeping the position of the hands as they were in 22. Perform 24 and 25 in a continuous motion.\n",
    "25": " Step 24. Lower the left foot to D, forming a left walking stance toward D while executing a high inward strike to D with a twin knife-hand.\n",
    "26": " Step 25. Execute a rising block with the left knife hand, maintaining a left walking stance toward D.\n",
    "27": " Step 26. Execute a low guarding block to D with a knife hand, while forming a right L-stance toward D, pulling the left foot.\n",
    "28": " Step 27. Execute a downward punch to D with the right fist while forming a left walking stance toward D, slipping the left foot.\n",
    "29": " Step 28. Move the left foot to the side rear of the right foot and then slide to C, forming a right L-stance toward D while executing a middle guarding block to D with a knife hand.\n",
    "30": " Step 29. Jump and land on the same spot, forming a right L-stance toward D while executing a middle guarding block to D with a knife hand.\n",
    "31": " Step 30. Jump to D to form a right X-stance toward BD, while executing a high side strike to D with the right back fist.\n",
    "32": " Step 31. Move the left foot to C, forming a left walking stance toward C, at the same time executing a high side block to C with the left outer forearm.\n",
    "33": " Step 32. Move the left foot on line CD, forming a right walking stance toward D while executing a high side block to D with the right outer forearm.\n",
    "34": " Step 33. Move the left foot to D, forming a right L-stance toward D, at the same time executing an upset punch to D with the right fist and bringing the left side fist in front of the right shoulder.\n",
    "35": " Step 34. Execute a middle hook kick to A with the right foot.\n",
    "36": " Step 35. Lower the right foot to A, forming a left L-stance toward A while executing a high cross cut to A with the right flat finger tip.\n",
    "37": " Step 36. Bring the right foot to the left foot and then execute a middle hook kick to B with the left foot.\n",
    "38": " Step 37. Lower the left foot to B, forming a right L-stance toward B, at the same time executing a high cross cut to B with the left flat finger tip.\n",
    "39": " Step 38. Bring the left foot to the right foot, and then move the right foot to A forming a left L-stance toward A, at the same time executing a high guarding block to A with a knife hand.\n",
    "40": " Step 39. Bring the right foot to the left foot, and then move the left foot to B forming a right L-stance toward B, at the same time executing a high guarding block to B with a knife hand.\n",
    "41": " End: Bring the foot back to a ready position\n",
    "title": "Ko-DangEdit"
  }
}