{
  "curPatternObj": {
    "0": " Number of Moves: 49\n",
    "1": " Ready Posture: Warrior Ready Stance A\n",
    "2": " Step 1. Slide to C to form a right L-stance toward D while executing a low guarding block to D with a reverse knife-hand. Perform in a circular motion.\n",
    "3": " Step 2. Execute a high punch to D with the right long fist while forming a left walking stance toward D pivoting with the left foot. Perform in slow motion.\n",
    "4": " Step 3. Slide to C forming a left L-stance toward D while executing a middle guarding block to D with the forearm.\n",
    "5": " Step 4. Execute a middle outward strike to D with the right knife-hand while flying to D and then land to D forming a left L-stance toward D with the right knife-hand extended to D.\n",
    "6": " Step 5. Shift to C maintaining a left L-stance toward D while executing a checking block to D with an X-fist.\n",
    "7": " Step 6. Execute a high outward cross-cut to D with the right flat finger tip while forming a right walking stance toward D, slipping the right foot.\n",
    "8": " Step 7. Execute a downward thrust with the right straight elbow while forming a left rear foot stance toward D, pulling the right foot.\n",
    "9": " Step 8. Jump to D forming a left X-stance toward AD while executing a high side strike to D with the left back fist.\n",
    "10": " Step 9. Move the right foot to C to form a left walking stance toward D while executing a low outward block to D with the right knife-hand.\n",
    "11": " Step 10. Move the right foot on line AB to form a parallel stance toward D while executing a middle hooking block to D with the left palm.\n",
    "12": " Step 11. Execute a middle punch to D with the right fist while maintaining a parallel stance toward D.\n",
    "13": " Step 12. Slide to C forming a left L-stance toward D while executing a low guarding block to D with a reverse knife-hand. Perform in a circular motion.\n",
    "14": " Step 13. Execute a high punch to D with the left long fist while forming a right walking stance toward D, pivoting with the right foot. Perform in slow motion.\n",
    "15": " Step 14. Slide to C forming a right L-stance toward D while executing a middle guarding block to D with the forearm.\n",
    "16": " Step 15. Execute a middle outward strike to D with the left knife-hand while flying to D and then land to D forming a right L-stance toward D with the left knife-hand extended to D.\n",
    "17": " Step 16. Shift to C maintaining a right L-stance toward D while executing a checking block to D with an X-fist.\n",
    "18": " Step 17. Execute a high outward cross-cut to D with the left flat finger tip while forming a left walking stance toward D, slipping the left foot.\n",
    "19": " Step 18. Execute a downward thrust with the left straight elbow while forming a right rear foot stance toward D, pulling the left foot.\n",
    "20": " Step 19. Jump to D forming a right X-stance toward BD while executing a high side strike to D with the right back fist.\n",
    "21": " Step 20. Move the left foot to C to form a right walking stance toward D while executing a low outward block to D with the left knife-hand.\n",
    "22": " Step 21. Move the left foot on line AB to form a parallel stance toward D while executing a middle hooking block to D with the right palm.\n",
    "23": " Step 22. Execute a middle punch to D with the left fist while maintaining a parallel stance toward D.\n",
    "24": " Step 23. Move the right foot to A to form a sitting stance toward D while executing a W-shape block with the reverse knife-hand.\n",
    "25": " Step 24. Cross the left foot over the right foot to form a right X-stance toward D while executing a horizontal thrust with a twin elbow.\n",
    "26": " Step 25. Move the right foot to A forming a sitting stance toward D while executing a checking block to D with a twin straight forearm.\n",
    "27": " Step 26. Cross the left foot over the right foot to form a right X-stance toward D while executing an upward punch with the right fist, pulling the left side fist in front of the right shoulder.\n",
    "28": " Step 27. Execute a high reverse hooking kick to B with the right foot.\n",
    "29": " Step 28. Lower the right foot to B and then execute a high side piercing kick to B with the left foot pulling both hands in front of the chest while turning clockwise.\n",
    "30": " Step 29. Lower the left foot to B in a jumping motion to form a left X-stance toward BD while executing a downward strike to B with the left backfist.\n",
    "31": " Step 30. Move the left foot to B to form a sitting stance toward D while executing a W-shape block with the reverse knife-hand.\n",
    "32": " Step 31. Cross the right foot over the left foot to form a left X-stance toward D while executing a horizontal thrust with a twin elbow.\n",
    "33": " Step 32. Move the left foot to B forming a sitting stance toward D while executing a checking block to D with a twin straight forearm.\n",
    "34": " Step 33. Cross the right foot over the left foot to form a left X-stance toward D while executing an upward punch with the left fist, pulling the right side fist in front of the left shoulder.\n",
    "35": " Step 34. Execute a high reverse hooking kick to A with the left foot.\n",
    "36": " Step 35. Lower the left foot to A and then execute a high side piercing kick to A with the right foot pulling both hands in front of the chest while turning counter clockwise.\n",
    "37": " Step 36. Lower the right foot to A in a jumping motion to form a right X-stance toward AD while executing a downward strike to A with the right backfist.\n",
    "38": " Step 37. Move the left foot to C forming a left L-stance toward D while executing a middle guarding block to D with the forearm.\n",
    "39": " Step 38. Move the left foot to D turning counter clockwise to form a left rear foot stance toward C while executing a waist block to C with the right inner forearm.\n",
    "40": " Step 39. Move the right foot to C slightly and then the left foot to D in a stamping motion to form a right L-stance toward D while executing a high outward strike to D with the left knife-hand.\n",
    "41": " Step 40. Shift to C maintaining a right L-stance toward D while executing a middle guarding block to D with the forearm.\n",
    "42": " Step 41. Move the right foot to D turning clockwise to form a right rear foot stance toward C while executing a waist block to C with the left inner forearm.\n",
    "43": " Step 42. Move the left foot to C slightly and then the right foot to D in a stamping motion to form a left L-stance toward D while executing a high outward strike to D with the right knife-hand.\n",
    "44": " Step 43. Move the right foot to C turning counter clockwise to form a right L-stance toward D while executing a middle guarding block to D with the forearm.\n",
    "45": " Step 44. Jump to execute a mid-air kick to D with the right foot while spinning clockwise and then land to D to form a left L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
    "46": " Step 45. Jump to execute a mid-air kick to D with the left foot while spinning counter clockwise and then land to D to form a right L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
    "47": " Step 46. Execute a low inward block to D with the right reverse knife-hand pulling the left side fist in front of the right shoulder while forming a left walking stance toward D, slipping the right foot to C.\n",
    "48": " Step 47. Slide to C to form a left L-stance toward D while thrusting to C with the left side elbow.\n",
    "49": " Step 48. Execute a low inward block to D with the left reverse knife-hand pulling the right side fist in front of the left shoulder while forming a right walking stance toward D, slipping the left foot to C.\n",
    "50": " Step 49. Slide to C forming a right L-stance toward D while thrusting to C with the right side elbow\n",
    "51": " End: Bring the foot back to a ready position\n",
    "title": "Yon-GaeEdit"
  }
}