{
  "curPatternObj": {
    "0": " Number of Moves: 38\n",
    "1": " Ready Posture: Parallel Ready Stance\n",
    "2": " Step 1. Move the left foot to B forming a sitting stance toward D while extending the left fist to D horizontally.\n",
    "3": " Step 2. Execute a middle punch to D with the right fist while maintaining a sitting stance toward D.\n",
    "4": " Step 3. Execute a middle punch to D with the left fist while maintaining a sitting stance toward D. Perform 2 and 3 in a fast motion.\n",
    "5": " Step 4. Bring the left foot to the right foot and then move the right foot to A forming a sitting stance toward D while extending the right fist to D horizontally.\n",
    "6": " Step 5. Execute a middle punch to D with the left fist while maintaining a sitting stance toward D.\n",
    "7": " Step 6. Execute a middle punch to D with the right fist while maintaining a sitting stance toward D. Perform 5 and 6 in a fast motion.\n",
    "8": " Step 7. Move the right foot to AD forming a right walking stance toward AD while executing a middle side block to AD with the right inner forearm.\n",
    "9": " Step 8. Execute a low front snap kick to AD with the left foot keeping the position of the hands as they were in 7.\n",
    "10": " Step 9. Lower the left foot to AD forming a left walking stance toward AD while executing a middle punch to AD with the left fist.\n",
    "11": " Step 10. Execute a middle punch to AD with the right fist while maintaining a left walking stance toward AD. Perform 9 and 10 in a fast motion.\n",
    "12": " Step 11. Move the left foot to BD forming a left walking stance toward BD at the same time executing a middle side block to BD with the left inner forearm.\n",
    "13": " Step 12. Execute a low front snap kick to BD with the right foot keeping the position of the hands as they were in 11.\n",
    "14": " Step 13. Lower the right foot to BD forming a right walking stance toward BD while executing a middle punch to BD with the right fist.\n",
    "15": " Step 14. Execute a middle punch to BD with the left fist while maintaining a right walking stance toward BD. Perform 13 and 14 in a fast motion.\n",
    "16": " Step 15. Execute a middle hooking block to D with the right palm while forming a right walking stance toward D, pivoting with the left foot.\n",
    "17": " Step 16. Execute a middle hooking block to D with the left palm while maintaining a right walking stance toward D.\n",
    "18": " Step 17. Execute a middle punch to D with the right fist while maintaining a right walking stance toward D. Execute 16 and 17 in a connecting motion.\n",
    "19": " Step 18. Move the left foot to D forming a left walking stance toward D while executing a middle hooking block to D with the left palm.\n",
    "20": " Step 19. Execute a middle hooking block to D with the right palm while maintaining a left walking stance toward D.\n",
    "21": " Step 20. Execute a middle punch to D with the left fist while maintaining a left walking stance toward D. Execute 19 and 20 in a connecting motion.\n",
    "22": " Step 21. Move the right foot to D forming a right walking stance toward D at the same time executing a middle punch to D with the right fist.\n",
    "23": " Step 22. Turn the face toward D forming a right bending ready stance A toward D.\n",
    "24": " Step 23. Execute a middle side piercing kick to D with the left foot.\n",
    "25": " Step 24. Lower the left foot to D forming a left walking stance toward D while striking the left palm with the right front elbow.\n",
    "26": " Step 25. Turn the face toward C forming a left bending ready stance A toward C.\n",
    "27": " Step 26. Execute a middle side piercing kick to C with the right foot.\n",
    "28": " Step 27. Lower the right foot to C forming a right walking stance toward C while striking the right palm with the left front elbow.\n",
    "29": " Step 28. Move the left foot to E forming a right L-stance toward E while executing a twin knife-hand block.\n",
    "30": " Step 29. Move the right foot to E forming a right walking stance toward E while executing a middle thrust to E with the right straight finger tip.\n",
    "31": " Step 30. Move the right foot to F turning clockwise to form a left L-stance toward F while executing a twin knife-hand block.\n",
    "32": " Step 31. Move the left foot to F forming a left walking stance toward F while executing a middle thrust to F with the left straight finger tip.\n",
    "33": " Step 32. Move the left foot to C forming a left walking stance toward C while executing a high side block to C with the left outer forearm.\n",
    "34": " Step 33. Execute a middle punch to C with the right fist while maintaining a left walking stance toward C.\n",
    "35": " Step 34. Move the right foot to C forming a right walking stance toward C while executing a high side block to C with the right outer forearm.\n",
    "36": " Step 35. Execute a middle punch to C with the left fist while maintaining a right walking stance toward C.\n",
    "37": " Step 36. Jump to C forming a left X-stance toward B while executing a high side strike to C with the left back fist.\n",
    "38": " Step 37. Move the right foot to A forming a right walking stance toward A at the same time executing a high block to A with the right double forearm.\n",
    "39": " Step 38. Bring the right foot to the left foot and then move the left foot to B forming a left walking stance toward B while executing a high block to B with the left double forearm.\n",
    "40": " End: Bring the foot back to a ready position\n",
    "title": "Yul-GokEdit"
  }
}