{
  "curPatternObj": {
    "patternSteps": {
      "0": " Number of Moves: 30\n",
      "1": " Ready Posture: Parallel Ready Stance\n",
      "2": " Step 1. Move the left foot to B forming a right L-stance toward B while executing a twin knife-hand block.\n",
      "3": " Step 2. Move the right foot to B forming a right walking stance toward B while executing a high front strike to B with the right knife-hand and bring the left back hand in front of the forehead.\n",
      "4": " Step 3. Move the right foot to A turning clockwise to form a left L-stance toward A while executing a middle guarding block to A with a knife-hand.\n",
      "5": " Step 4. Move the left foot to A forming a left walking stance toward A while executing a high thrust to A with the left flat finger tip.\n",
      "6": " Step 5. Move the left foot to D forming a right L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
      "7": " Step 6. Turn the face to C forming a left bending ready stance A toward C.\n",
      "8": " Step 7. Execute a middle side piercing kick to C with the right foot.\n",
      "9": " Step 8. Lower the right foot to C forming a right L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
      "10": " Step 9. Execute a flying side piercing kick to D with the right foot soon after moving it to D and then land to D forming a left L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
      "11": " Step 10. Move the left foot to E turning counter clockwise to form a right L-stance toward E at the same time executing a low block to E with the left forearm.\n",
      "12": " Step 11. Extend both hands upward as if to grab the opponent's head while forming a left walking stance toward E, slipping the left foot.\n",
      "13": " Step 12. Execute an upward kick to E with the right knee pulling both hands downward.\n",
      "14": " Step 13. Lower the right foot to the left foot and then move the left foot to F forming a left walking stance toward F while executing a high front strike to F with the right reverse knife-hand, bringing the left back hand under the right elbow joint.\n",
      "15": " Step 14. Execute a high turning kick to DF with the right foot and then lower it to the left foot.\n",
      "16": " Step 15. Execute a middle back piercing kick to F with the left foot. Perform 14 and 15 in a fast motion.\n",
      "17": " Step 16. Lower the left foot to F forming a left L-stance toward E while executing a middle guarding block to E with the forearm.\n",
      "18": " Step 17. Execute a middle turning kick to DE with the left foot.\n",
      "19": " Step 18. Lower the left foot to the right foot and then move the right foot to C forming a right fixed stance toward C while executing a U-shape block toward C.\n",
      "20": " Step 19. Jump and spin around counter clockwise, landing on the same spot to form a left L-stance toward C while executing a middle guarding block to C with a knife-hand.\n",
      "21": " Step 20. Move the left foot to C forming a left walking stance toward C at the same time executing a low thrust to C with the right upset fingertip.\n",
      "22": " Step 21. Execute a side back strike to D with the right back fist and a low block to C with the left forearm while forming a right L-stance toward C, pulling the left foot.\n",
      "23": " Step 22. Move the right foot to C forming a right walking stance toward C while executing a middle thrust to C with the right straight finger tip.\n",
      "24": " Step 23. Move the left foot to B turning counter clockwise to form a left walking stance toward B while executing a high block to B with the left double forearm.\n",
      "25": " Step 24. Move the right foot to B forming a sitting stance toward C while executing a middle front block to C with the right forearm and then a high side strike to B with the right back fist.\n",
      "26": " Step 25. Execute a middle side piercing kick to A with the right foot turning counter clockwise and then lower it to A.\n",
      "27": " Step 26. Execute a middle side piercing kick to A with the left foot turning clockwise.\n",
      "28": " Step 27. Lower the left foot to A and then execute a checking block to B with an X-knife-hand while forming a left L-stance toward B pivoting with the left foot.\n",
      "29": " Step 28. Move the left foot to B forming a left walking stance toward B while executing an upward block to B with a twin palm.\n",
      "30": " Step 29. Move the left foot on line AB and then execute a rising block with the right forearm while forming a right walking stance toward A.\n",
      "31": " Step 30. Execute a middle punch to A with the left fist while maintaining a right walking stance toward A.\n",
      "32": " End: Bring the foot back to a ready position\n"
    },
    "title": " Choong-Moo "
  }
}