{
  "curPatternObj": {
    "patternSteps": {
      "0": " Number of Moves: 32\n",
      "1": " Ready Posture: Closed Ready Stance B\n",
      "2": " Step 1. Move the left foot to B forming a right L-stance toward B while executing a middle block to B with the left reverse knife-hand.\n",
      "3": " Step 2. Execute a low side front snap kick to B with the left foot, keeping the position of the hands as they were in 1.\n",
      "4": " Step 3. Lower the left foot to B and then move the right foot to B forming a left rear foot stance toward B while executing an upward block with a right palm.\n",
      "5": " Step 4. Move the right foot to A forming a left L-stance toward A, at the same time executing a middle block to A with a right reverse knife-hand.\n",
      "6": " Step 5. Execute a low side front snap kick to A with the right foot, keeping the position of the hands as they were in 4.\n",
      "7": " Step 6. Lower the right foot to A and then move the left foot to A forming a right rear foot stance toward A while executing an upward block with a left palm.\n",
      "8": " Step 7. Move the left foot to D forming a right L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
      "9": " Step 8. Execute a right upper elbow strike while forming a left walking stance toward D, slipping the left foot to D.\n",
      "10": " Step 9. Move the right foot to D forming a left L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
      "11": " Step 10. Execute a left upper elbow strike while forming a right walking stance toward D, slipping the right foot to D.\n",
      "12": " Step 11. Move the left foot to D forming a left walking stance toward D while executing a high vertical punch to D with a twin fist.\n",
      "13": " Step 12. Move the right foot to D forming a right walking stance toward D while executing an upset punch to D with a twin fist.\n",
      "14": " Step 13. Move the right foot on line CD and then turn counter clockwise to form a left walking stance toward C while executing a rising block with an X-fist.\n",
      "15": " Step 14. Move the left foot to E forming a right L-stance toward E while executing a high side strike to E with the left back fist.\n",
      "16": " Step 15. Twist the left fist counter clockwise until the back fist faces downward, at the same time forming a left walking stance toward E, slipping the left foot to E.\n",
      "17": " Step 16. Execute a high punch to E with the right fist while maintaining a left walking stance toward E. Perform 15 and 16 in a fast motion.\n",
      "18": " Step 17. Bring the left foot to the right foot and then move the right foot to F, forming a left L-stance toward F while executing a high side strike to F with a right back fist.\n",
      "19": " Step 18. Twist the right fist clockwise until the back fist faces downward, at the same time forming a right walking stance toward F, slipping the right foot to F.\n",
      "20": " Step 19. Execute a high punch to F with the left fist while maintaining a right walking stance toward F. Perform 18 and 19 in a fast motion.\n",
      "21": " Step 20. Bring the right foot to the left foot and then move the left foot to C forming a left walking stance toward C while executing a high block to C with a left double forearm.\n",
      "22": " Step 21. Execute a middle punch to C with the left fist while forming a right L-stance toward C, pulling the left foot.\n",
      "23": " Step 22. Execute a middle side piercing kick to C with the right foot.\n",
      "24": " Step 23. Lower the right foot to C forming a right walking stance toward C while executing a high block to C with the right double forearm.\n",
      "25": " Step 24. Execute a middle punch to C with the right fist while forming a left L-stance toward C, pulling the right foot.\n",
      "26": " Step 25. Execute a middle side piercing kick to C with the left foot.\n",
      "27": " Step 26. Lower the left foot to C forming a right L-stance toward C while executing amiddle guarding block to C with the forearm.\n",
      "28": " Step 27. Execute a pressing block with the right palm while forming a left low stance toward C, slipping the left foot to C. Perform in slow motion..\n",
      "29": " Step 28. Move the right foot to C forming a left L-stance toward C while executing a middle guarding block to C with the forearm.\n",
      "30": " Step 29. Execute a pressing block with the left palm while forming a right low stance toward C, slipping the right foot to C. Perform in a slow motion.\n",
      "31": " Step 30. Bring the left foot to the right foot forming a closed stance toward A while executing an angle punch with the right fist. Perform in slow motion.\n",
      "32": " Step 31. Move the right foot to A forming a right fixed stance toward A while executing a U-shape block to A.\n",
      "33": " Step 32. Bring the right foot to the left foot and then move the left foot to B forming a left fixed stance toward B, at the same time executing a U-shape block to B.\n",
      "34": " End: Bring the foot back to a ready position.\n"
    },
    "title": " Joong-Gun "
  }
}