{
  "curPatternObj": {
    "patternSteps": {
      "0": " Number of Moves: 72\n",
      "1": " Ready Posture: Closed Ready Stance A\n",
      "2": " Step 1. Slide to C to form a right rear foot stance toward D while executing a middle guarding block to D with the forearm.\n",
      "3": " Step 2. Execute a middle vertical punch to D with the right fist while forming a left walking stance toward D, slipping the left foot.\n",
      "4": " Step 3. Slide to C to form a left rear foot stance toward D while executing a middle guarding block to D with the forearm.\n",
      "5": " Step 4. Execute a middle vertical punch to D with the left fist while forming a right walking stance toward D, slipping the right foot.\n",
      "6": " Step 5. Execute a high side block to BC with the right knife-hand while forming a left walking stance toward BC.\n",
      "7": " Step 6. Execute a middle punch to BD with the left fist while forming a sitting stance toward BD. Perform 5 and 6 in a fast motion.\n",
      "8": " Step 7. Execute a high side block to BD with the left knife-hand while forming a right walking stance toward BD.\n",
      "9": " Step 8. Execute a middle punch to BD with the right fist while forming a sitting stance toward BD. Perform 7 and 8 in a fast motion.\n",
      "10": " Step 9. Move the right foot to C turning clockwise to form a parallel stance toward A while executing a horizontal strike with a twin knife-hand.\n",
      "11": " Step 10. Execute a high side piercing kick to C with the right foot keeping the position of the hands as they were in 9.\n",
      "12": " Step 11. Execute a high turning kick to D with the right foot. Perform 10 and 11 in a continuous kick.\n",
      "13": " Step 12. Lower the right foot to D in a jumping motion to form a right X-stance toward BD while executing a high side strike to D with the right back fist and bringing the left finger belly to the right side fist.\n",
      "14": " Step 13. Move the left foot to C forming a parallel stance toward B while executing a horizontal strike with a twin knife-hand.\n",
      "15": " Step 14. Execute a high side piercing kick to C with the left foot keeping the position of the hands as they were in 13.\n",
      "16": " Step 15. Execute a high turning kick to D with the left foot. Perform 14 and 15 in a continuous kick.\n",
      "17": " Step 16. Lower the left foot to D in a jumping motion to form a left X-stance toward AD while executing a high side strike to D with the left back fist and bringing the right finger belly to the left side fist.\n",
      "18": " Step 17. Move the left foot to A forming a right L-stance toward A executing a low punch to A with a left double fist.\n",
      "19": " Step 18. Bring the right palm on the left fore fist and then twist them counter clockwise until the left back fist faces downward while forming a left walking stance toward A, slipping the left foot. Perform in a releasing motion.\n",
      "20": " Step 19. Execute a high punch to A with the right fist while maintaining a left walking stance toward A.\n",
      "21": " Step 20. Move the left foot on line AB to form a left L-stance toward B while executing a low punch to B with a right double fist.\n",
      "22": " Step 21. Bring the left palm on the right fore fist and then twist them clockwise until the right back fist faces downward while forming a right walking stance toward B, slipping the right foot. Perform in a releasing motion.\n",
      "23": " Step 22. Execute a high punch to B with the left fist while maintaining a right walking stance toward B.\n",
      "24": " Step 23. Slide to B to form a right L-stance toward B while executing an upset punch to B with the right middle knuckle fist and bringing the left side fist in front of the right shoulder.\n",
      "25": " Step 24. Execute a front strike to B with the right back fist while forming a left walking stance toward B, slipping the right foot.\n",
      "26": " Step 25. Slide to A, turning clockwise to form a left L-stance toward A while executing an upset punch to A with the left middle knuckle fist and bringing the right side fist in front of the left shoulder.\n",
      "27": " Step 26. Execute a front strike to A with the left back fist while forming a right walking stance toward A, slipping the left foot.\n",
      "28": " Step 27. Move the left foot to D forming a right walking ready stance toward C.\n",
      "29": " Step 28. Jump to execute a flying front snap kick to C with the right foot.\n",
      "30": " Step 29. Land to C forming a left L-stance toward C while executing a middle guarding block to C with a knife-hand.\n",
      "31": " Step 30. Move the right foot to D to form a left walking stance toward C while executing a high front block with the right forearm.\n",
      "32": " Step 31. Execute a middle punch to C with the left fist while shifting to C, maintaining a left walking stance toward C.\n",
      "33": " Step 32. Turn clockwise, pivoting with the left foot to form a right walking stance toward D while executing a high front block with the left forearm.\n",
      "34": " Step 33. Execute a middle punch to D with the right fist while shifting to D, maintaining a right walking stance toward D.\n",
      "35": " Step 34. Execute a middle block to BC with a double arc-hand while forming a left walking stance toward BC and looking through the hands.\n",
      "36": " Step 35. Execute a high inward strike to BC with the right knife-hand and bringing the left side fist in front of the right shoulder while maintaining a left walking stance toward BC.\n",
      "37": " Step 36. Execute a circular block to BD with the left inner forearm while forming a right walking stance toward D.\n",
      "38": " Step 37. Execute a high punch to D with the right fist while maintaining a right walking stance toward D.\n",
      "39": " Step 38. Execute a low front snap kick to D with the left foot keeping the position of the hands as they were in 37.\n",
      "40": " Step 39. Lower the left foot to D forming a left walking stance toward D while executing amiddle punch to D with the left fist.\n",
      "41": " Step 40. Execute a middle punch to D with the right fist while maintaining a left walking stance toward D. Perform 39 and 40 in a fast motion.\n",
      "42": " Step 41. Execute a rising block with an X-knife-hand while maintaining a left walking stance toward D.\n",
      "43": " Step 42. Execute a middle block to AC with a double arc-hand while forming a right walking stance toward AC and looking through the hands.\n",
      "44": " Step 43. Execute a high inward strike to AC with the left knife-hand and bringing the right side fist in front of the left shoulder while maintaining a right walking stance toward AC.\n",
      "45": " Step 44. Execute a circular block to AD with the right inner forearm while forming a left walking stance toward D.\n",
      "46": " Step 45. Execute a high punch to D with the left fist while maintaining a left walking stance toward D.\n",
      "47": " Step 46. Execute a low front snap kick to D with the right foot keeping the position of the hands as they were in 45.\n",
      "48": " Step 47. Lower the right foot to D forming a right walking stance toward D while executing a middle punch to D with the right fist.\n",
      "49": " Step 48. Execute a middle punch to D with the left fist while maintaining a right walking stance toward D. Perform 47 and 48 in a fast motion.\n",
      "50": " Step 49. Execute a rising block with an X-knife-hand while maintaining a right walking stance toward D.\n",
      "51": " Step 50. Move the left foot to D, and then slide to D, turning counter-clockwise to form a right L-stance toward C while executing a low guarding block to C with a knife-hand.\n",
      "52": " Step 51. Jump to C, spinning counter-clockwise to form a right L-stance toward D while executing a middle guarding block to D with the forearm.\n",
      "53": " Step 52. Execute a low block to D with the right knife-hand and a middle outward block to D with the left inner forearm while forming a left walking stance toward D, slipping the left foot.\n",
      "54": " Step 53. Execute a high punch to D with the right fist while maintaining a left walking stance toward D. Perform 52 and 53 in a continuous motion.\n",
      "55": " Step 54. Execute a middle punch to D with the left fist while forming a right L-stance toward D, pulling the left foot.\n",
      "56": " Step 55. Move the right foot to D, and then slide to D, turning clockwise to form a left L-stance toward C while executing a low guarding block to C with a knife-hand.\n",
      "57": " Step 56. Jump to C, spinning clockwise to form a left L-stance toward D while executing a middle guarding block to D with the forearm.\n",
      "58": " Step 57. Execute a low block to D with the left knife-hand and a middle outward block to D with the right inner forearm while forming a right walking stance toward D slipping the right foot.\n",
      "59": " Step 58. Execute a high punch to D with the left fist while maintaining a right walking stance toward D. Perform 57 and 58 in a continuous motion.\n",
      "60": " Step 59. Execute a middle punch to D with the right fist while forming a left L-stance toward D, pulling the right foot.\n",
      "61": " Step 60. Move the right foot to the side rear of the left foot, and then slide to C, forming a left L-stance toward D at the same time executing a scooping block with the right palm.\n",
      "62": " Step 61. Shift to D, maintaining a left L-stance toward D while executing a middle punch to D with the left fist.\n",
      "63": " Step 62. Turn clockwise while forming a left bending ready stance A toward C.\n",
      "64": " Step 63. Execute a high side piercing kick to C with the right foot, keeping the position of the hands as they were in 62.\n",
      "65": " Step 64. Lower the right foot to C, forming a right walking stance toward C while executing a middle punch to C with the left fist.\n",
      "66": " Step 65. Move the right foot to D, forming a right L-stance toward C while executing a middle guarding block to C with a knife-hand.\n",
      "67": " Step 66. Move the left foot to the side rear of the right foot, and then slide to D, forming a right L-stance toward C while executing a scooping block with the left palm.\n",
      "68": " Step 67. Shift to C, maintaining a right L-stance toward C while executing a middle punch to C with the right fist.\n",
      "69": " Step 68. Turn counter-clockwise while forming a right bending ready stance A toward C.\n",
      "70": " Step 69. Execute a high side piercing kick to D with the left foot, keeping the position of the hands as they were in 68.\n",
      "71": " Step 70. Lower the left foot to D to form a left walking stance toward D at the same time executing a middle punch to D with the right fist.\n",
      "72": " Step 71. Move the left foot to C to form a left L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
      "73": " Step 72. Execute a high punch to D with the right fist while forming a right walking stance toward D, slipping the right foot. Perform 71 and 72 in a continuous motion.\n",
      "74": " End: Bring the foot back to a ready position\n"
    },
    "title": " So-San "
  }
}