{
  "curPatternObj": {
    "patternSteps": {
      "0": " Number of Moves: 42\n",
      "1": " Ready Posture: Parallel Stance with an X-Back Hand\n",
      "2": " Step 1. Move the left foot to C forming a right walking stance toward D while executing a horizontal strike with twin side fists.\n",
      "3": " Step 2. Move the right foot to C to form a left walking stance toward D while executing a pressing block with an X-fist.\n",
      "4": " Step 3. Execute a rising block with an X-knife-hand while maintaining a left walking stance toward D. Perform 2 and 3 in a continuous motion.\n",
      "5": " Step 4. Execute a high front strike to D with the right knife-hand bringing the left palm on the right elbow joint while maintaining a left walking stance toward D.\n",
      "6": " Step 5. Move the left foot to C to form a sitting stance toward B while executing a horizontal strike to C with the left back hand.\n",
      "7": " Step 6. Execute a middle crescent kick to the left palm with the right foot.\n",
      "8": " Step 7. Lower the right foot to C, forming a sitting stance toward A while striking the left palm with the right front elbow.\n",
      "9": " Step 8. Thrust to B with the left back elbow placing the right side fist on the left fist while maintaining a sitting stance toward A.\n",
      "10": " Step 9. Execute a side back strike to B with the right back fist and extending the left arm to the side-downward while maintaining a sitting stance toward A.\n",
      "11": " Step 10. Bring the left foot to the right foot, forming a close stance toward D, at the same time thrusting with a twin side elbow.\n",
      "12": " Step 11. Cross the left foot to the right foot, forming a close stance toward D while turning the face to A, Keeping the position of the hands as they were in 10. Perform in a fast motion.\n",
      "13": " Step 12. Execute a middle side piercing kick to A with the right foot keeping the position of the hands as they were in 11.\n",
      "14": " Step 13. Lower the right foot to A, and then cross the left foot over the right foot, forming a right X-stance toward D while executing a horizontal thrust with a twin elbow.\n",
      "15": " Step 14. Move the right foot to A to form the sitting stance toward D while executing a right horizontal punch to A.\n",
      "16": " Step 15. Execute a high front strike to D with right knife-hand, bringing the left back hand in front of the forehead while standing up toward D.\n",
      "17": " Step 16. Execute a twin knife-hand block to B while forming a right L-stance toward B, pivoting with the right foot.\n",
      "18": " Step 17. Jump to execute a mid-air kick to B with the right foot while spinning clockwise.\n",
      "19": " Step 18. Land to B forming a right walking stance toward B while executing a middle block to B with the right double forearm.\n",
      "20": " Step 19. Bring the left foot to the right foot to form a closed ready stance B toward D.\n",
      "21": " Step 20. Jump to D forming a right X-stance toward BD while executing a high side strike to B with the right back fist bringing the left finger belly to the right side fist.\n",
      "22": " Step 21. Move the left foot to C to form a right walking stance toward D while executing a rising block with the left forearm.\n",
      "23": " Step 22. Execute a middle front snap kick to D with the left foot keeping the position of the hands as they were in 21.\n",
      "24": " Step 23. Lower the left foot to D forming a left walking stance toward D while executing a high punch to D with the right fist.\n",
      "25": " Step 24. Move the right foot to D to form a right walking stance toward D while executing a middle thrust to D with the right straight fingertip.\n",
      "26": " Step 25. Move the left foot to D turning counter-clockwise to form a sitting stance toward A while executing a high side strike to D with the left back fist.\n",
      "27": " Step 26. Move the right foot to F turning counter-clockwise to form a right walking ready stance toward F.\n",
      "28": " Step 27. Jump to execute a flying high kick to F with the right foot.\n",
      "29": " Step 28. Land to F to form a right fixed stance toward F while executing a checking block to F with an X-knife hand.\n",
      "30": " Step 29. Move the left foot to F forming a right L-stance toward F while executing a pressing block with an X-fist.\n",
      "31": " Step 30. Execute a middle side front snap kick to F with the left foot while executing a middle wedging block with the inner forearm. Execute a middle side front snap kick to F with the left foot while executing a middle wedging block with the inner forearm.\n",
      "32": " Step 31. Lower the left foot to F forming a left walking stance toward F while executing a high vertical punch to F with a twin fist.\n",
      "33": " Step 32. Move the right foot to F to form a right fixed stance toward F while executing a middle outward block with the right knife hand and a middle pushing block with the left palm.\n",
      "34": " Step 33. Slide to F forming a right L-stance toward F while executing a middle punch to F with the left fist.\n",
      "35": " Step 34. Move the left foot to the side rear of the right foot and the right foot to E to form a right L-stance toward F and then jump to E maintaining a right L-stance towards F while executing a middle guarding block to F with the forearm.\n",
      "36": " Step 35. Execute a middle turning kick to DF with the right foot.\n",
      "37": " Step 36. Lower the right foot to F and then execute a middle back piercing kick to F with the left foot.\n",
      "38": " Step 37. Lower the left foot to F to form a right L-stance toward F while executing a middle guarding block to F with the forearm.\n",
      "39": " Step 38. Move the left foot to E forming a left l-stance toward F while executing an upward block to F with the right palm.\n",
      "40": " Step 39. Move the right foot to E forming a right walking stance to E while executing a circular block to ED with the left inner forearm.\n",
      "41": " Step 40. Execute a circular block to DE with the right inner forearm while forming a right walking stance toward DF.\n",
      "42": " Step 41. Move the left foot on line EF to form a sitting stance toward D while executing a middle punch to D with the left fist.\n",
      "43": " Step 42. Execute a middle punch to D with the right fist while maintaining a sitting stance toward D.\n",
      "44": " End: Bring the foot back to a ready position\n"
    },
    "title": " Ul-Ji "
  }
}